user/tutorials/Nike/ISAT_paper/shockDroplet_codestream_longer_C12test_C_2d_1C_low_T_ISAT_1e_4/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme      Kurganov;
//divScheme       Doubleflux;

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         Gauss linear;//none;
    div(tauMC)      Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
    reconstruct(rho) vanLeer;
    reconstruct(U)  vanLeerV;
    reconstruct(DF) upwind;
    reconstruct(rhoYi) vanLeer;
    reconstruct(rPsi) vanLeer;
    reconstruct(e) vanLeer;
    reconstruct(soundspeed) vanLeer;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
